In [1]:
import numpy as np
import pandas as pd

In [3]:
d=pd.DataFrame([12,123,4,56,78,954,21,23])
d

     0
0   12
1  123
2    4
3   56
4   78
5  954
6   21
7   23

In [6]:
d.dtypes

0    int64
dtype: object

In [10]:
e=d.astype('float')
e

       0
0   12.0
1  123.0
2    4.0
3   56.0
4   78.0
5  954.0
6   21.0
7   23.0

In [11]:
s=pd.DataFrame(['1','2','3'])
s

   0
0  1
1  2
2  3

In [12]:
s.dtypes

0    object
dtype: object

In [15]:
s=s.astype('int')
s

   0
0  1
1  2
2  3

In [16]:
s.dtypes

0    int32
dtype: object

# Conditional selection

In [17]:
d

     0
0   12
1  123
2    4
3   56
4   78
5  954
6   21
7   23

In [ ]:
# if we apply some condition the result will be Boolean output

In [19]:
d>78

       0
0  False
1   True
2  False
3  False
4  False
5   True
6  False
7  False

In [23]:
d[0][1]>5

True

In [24]:
d[0]>86

0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
Name: 0, dtype: bool

In [26]:
d

     0
0   12
1  123
2    4
3   56
4   78
5  954
6   21
7   23

In [28]:
d[d>55]#using dataframe directly as an index
#NaN Not a number

       0
0    NaN
1  123.0
2    NaN
3   56.0
4   78.0
5  954.0
6    NaN
7    NaN

In [30]:
d[d[0]>55] #using Series

     0
1  123
3   56
4   78
5  954

# Where

In [32]:
d>55

       0
0  False
1   True
2  False
3   True
4   True
5   True
6  False
7  False

In [33]:
d.where(d>55)#Replace values where the condition is False.

       0
0    NaN
1  123.0
2    NaN
3   56.0
4   78.0
5  954.0
6    NaN
7    NaN

In [36]:
d.where(d[0]>55)
#where the condition is false there u will get NaN

       0
0    NaN
1  123.0
2    NaN
3   56.0
4   78.0
5  954.0
6    NaN
7    NaN

In [44]:
d.where(d>55,'*')#if we want to fill other values instead of nan then we can put like this

     0
0    *
1  123
2    *
3   56
4   78
5  954
6    *
7    *

In [46]:
d.mean()

0    158.875
dtype: float64

In [47]:
d.where(d[0]>55,-d)

     0
0  -12
1  123
2   -4
3   56
4   78
5  954
6  -21
7  -23

In [52]:
d.where(d[0]>55,d.mean(),axis=1)# when u want to fill the values by mean ,meadian or any other attribute provide the axis, it must

         0
0  158.875
1  123.000
2  158.875
3   56.000
4   78.000
5  954.000
6  158.875
7  158.875

In [66]:
f=pd.DataFrame(np.random.rand(4,4))
f

          0         1         2         3
0  0.137431  0.064112  0.045084  0.914482
1  0.037912  0.651552  0.669060  0.943809
2  0.720872  0.842435  0.156380  0.198855
3  0.958535  0.516639  0.109878  0.454027

In [68]:
f.where(f>0.5,"*")

          0         1        2         3
0         *         *        *  0.914482
1         *  0.651552  0.66906  0.943809
2  0.720872  0.842435        *         *
3  0.958535  0.516639        *         *

In [71]:
f.mean()

0    0.463688
1    0.518685
2    0.245100
3    0.627793
dtype: float64

In [69]:
f.where(f>0.1)

          0         1         2         3
0  0.137431       NaN       NaN  0.914482
1       NaN  0.651552  0.669060  0.943809
2  0.720872  0.842435  0.156380  0.198855
3  0.958535  0.516639  0.109878  0.454027

In [73]:
f.where(f>0.1,f.mean(),axis=0)

          0         1         2         3
0  0.137431  0.463688  0.463688  0.914482
1  0.518685  0.651552  0.669060  0.943809
2  0.720872  0.842435  0.156380  0.198855
3  0.958535  0.516639  0.109878  0.454027

In [111]:
 f

          0         1        2         3
0  0.137431  0.064112      NaN  0.914482
1  0.037912  0.651552  0.66906  0.943809
2  0.720872  0.842435      NaN  0.198855
3  0.958535  0.516639      NaN  0.454027

In [78]:
f[2]

0    0.045084
1    0.669060
2    0.156380
3    0.109878
Name: 2, dtype: float64

In [81]:
pd.DataFrame(f[2].where(f[2]>0.4,"*"))

         2
0        *
1  0.66906
2        *
3        *

In [94]:
f[[2]].where(f[[2]]>.5)

         2
0      NaN
1  0.66906
2      NaN
3      NaN

In [95]:
f

          0         1        2         3
0  0.137431  0.064112      NaN  0.914482
1  0.037912  0.651552  0.66906  0.943809
2  0.720872  0.842435      NaN  0.198855
3  0.958535  0.516639      NaN  0.454027

In [96]:
f[2].where(f[2]>0.5)

0        NaN
1    0.66906
2        NaN
3        NaN
Name: 2, dtype: float64

In [85]:
f

          0         1        2         3
0  0.137431  0.064112      NaN  0.914482
1  0.037912  0.651552  0.66906  0.943809
2  0.720872  0.842435      NaN  0.198855
3  0.958535  0.516639      NaN  0.454027

# Mask

In [104]:
#mask is exactly opposite of where
#means mask will make NaN whre condition is True and will get Values wher condition is False
q=pd.DataFrame(np.random.rand(4,4),columns=["a","b","c","d"])
q

          a         b         c         d
0  0.957727  0.432806  0.769228  0.312446
1  0.239940  0.656768  0.802424  0.941130
2  0.906372  0.195252  0.126454  0.655777
3  0.883833  0.621910  0.418776  0.488148

In [105]:
q["b"]>.5

0    False
1     True
2    False
3     True
Name: b, dtype: bool

In [106]:
q[['b']].mask(q[["b"]]>.5)

          b
0  0.432806
1       NaN
2  0.195252
3       NaN

In [107]:
q

          a         b         c         d
0  0.957727  0.432806  0.769228  0.312446
1  0.239940  0.656768  0.802424  0.941130
2  0.906372  0.195252  0.126454  0.655777
3  0.883833  0.621910  0.418776  0.488148

In [109]:
q[['b','c']].mask(q[['b','c']]>.5,-1)

          b         c
0  0.432806 -1.000000
1 -1.000000 -1.000000
2  0.195252  0.126454
3 -1.000000  0.418776

# query

In [114]:
df=pd.DataFrame({"A":[1,2,3,4],"B":[45,8,6,3],"C":[55,88,99,66],"D":[87,99,5,6]})
df

   A   B   C   D
0  1  45  55  87
1  2   8  88  99
2  3   6  99   5
3  4   3  66   6

In [120]:
df.query("A>B")

   A  B   C  D
3  4  3  66  6

In [121]:
df.query("A==2")

   A  B   C   D
1  2  8  88  99

In [124]:
df[df.A==2]

   A  B   C   D
1  2  8  88  99

In [126]:
#fetch the value from column B where value of column A==2
df.query('A==2')["B"]

1    8
Name: B, dtype: int64

In [127]:
df.query('A==2').B

1    8
Name: B, dtype: int64

In [136]:
df[df['A']==2]['B']

1    8
Name: B, dtype: int64

In [137]:
df['A']+df['B']

0    46
1    10
2     9
3     7
dtype: int64

In [145]:
pd.eval(df.A+df.B)

array([46, 10, 9, 7], dtype=object)

In [146]:
pd.eval('df.A+df.B')

0    46
1    10
2     9
3     7
dtype: int64

In [144]:
df.eval('A+C')

0     56
1     90
2    102
3     70
dtype: int64